// import {IRecipe} from './app/shared/models/recipe.model';

export const recipies = [
  {
    description: '',
    image: 'https://img01.rl0.ru/eda/c380x380i/s1.eda.ru/Photos/120214133254-120214133453-p-O-kurica-pikasso.jpg',
    recipeIngredient: [
      {
        name: 'Куриная грудка',
        count: '1000',
        measure: 'гр.'
      },
      {
        name: 'Лук',
        count: '2',
        measure: 'шт.'
      },
      {
        name: 'Сладкий перец',
        count: '3',
        measure: 'шт.'
      },
      {
        name: 'Чеснок',
        count: '3',
        measure: 'шт.'
      },
      {
        name: 'Помидоры',
        count: '4',
        measure: 'шт.'
      },
      {
        name: 'Сыр',
        count: '100',
        measure: 'гр.'
      },
      {
        name: 'Помидоры',
        count: '4',
        measure: 'шт.'
      },
      {
        name: 'Смесь итальянских трав',
        count: '1',
        measure: 'ст.л.'
      },
      {
        name: 'Вода',
        count: '125',
        measure: 'гр.'
      },
      {
        name: 'Сливки',
        count: '125',
        measure: 'гр.'
      },
      {
        name: 'Оливковое масло',
        count: '2',
        measure: 'ст.л'
      },
      {
        name: 'Сливочное масло',
        count: '1',
        measure: 'ст.л.'
      },
      {
        name: 'Мускатный орех'
      },
      {
        name: 'Соль'
      },
      {
        name: 'Перец черный молотый'
      }
    ],
    'nutrition': {
      '@type': 'NutritionInformation',
      'calories': '637',
      'fatContent': '31',
      'carbohydrateContent': '21',
      'proteinContent': '70'
    },
    recipeInstructions: [
      'Нарежьте болгарский перец кольцами (лучше выбрать трех разных цветов — это выглядит красочнее), предварительно удалив семена. Лук нарезать полукольцами, чеснок натереть на мелкой терке.',
      'Куриные грудки посолить, поперчить. В комбинации 2 столовые ложки оливкового и 1 столовая ложка сливочного масла, обжарить грудки до золотистой корочки. Переложить в форму для духовки.',
      'В этой же сковороде обжарить лук до золотистого цвета, переложить в форму к курице.',
      'Время для болгарского перца — слегка обжарить кольца, пока они не станут мягкими — и к курице.',
      'Тертый чеснок поместить в сковороду, пассеровать 30 секунд, затем залить водой, добавив нарезанные помидоры (кожицу можно предварительно удалить), хорошо перемешать. Добавить итальянских трав, овощной бульонный кубик, соль, перец, щепотку мускатного ореха. Влить полстакана сливок, перемешать.',
      'Варить соус 5 минут на медленном огне. Залить им курицу с овощами. Закрыть фольгой, отправить в духовку при температуре 200 градусов на 30 минут.',
      'Достать, посыпать натертым на терке сыром, поместить курицу обратно в духовку, но уже без фольги, еще на 15 минут, пока сыр не расплавится.'
    ],
    recipeYield: '4 порции',
    recipeCategory: 'Основные блюда',
    url: 'https://eda.ru/recepty/osnovnye-blyuda/kurica-pikasso-25902',
    name: 'Курица «Пикассо»',
    id: 0
  },
  {
    description: '',
    image: 'https://img01.rl0.ru/eda/c380x380i/s1.eda.ru/Photos/170122183544-170209213750-p-O-kurica-v-kislo-sladkom-souse-po-kitajski.jpg',
    recipeIngredient: [
      {
        name: 'Куриное филе',
        count: '500',
        measure: 'гр.'
      },
      {
        name: 'Соевый соус',
        count: '10',
        measure: 'ст.л.'
      },
      {
        name: 'Яблочный уксус',
        count: '40',
        measure: 'мл.'
      },
      {
        name: 'Сахар',
        count: '5',
        measure: 'ч.л.'
      },
      {
        name: 'Вода',
        count: '1/2',
        measure: 'ст.'
      },
      {
        name: 'Томатная паста ',
        count: '2',
        measure: 'ст.л.'
      },
      {
        name: 'Сладкий перец',
        count: '1',
        measure: 'шт.'
      },
      {
        name: 'Консервированный ананас',
        count: '1',
        measure: 'шт.'
      },
      {
        name: 'Помидоры',
        count: '2',
        measure: 'шт.'
      }
    ],
    'nutrition': {
      '@type': 'NutritionInformation',
      'calories': '261',
      'fatContent': '2',
      'carbohydrateContent': '24',
      'proteinContent': '36'
    },
    recipeInstructions: [
      'Куриное филе нарезать тонкими полосками, сложить в миску, залить соевым соусом (примерно 6 столовых ложек) и немного поперчить.\r\n',
      'Для приготовления соуса в глубокой сковородке, лучше в воке, смешать уксус, соевый соус (примерно 4 столовые ложки), томатную пасту. Поставить на огонь и прогреть, добавив часть сахара. Добавить воды, положить нарезанный полосками перец, консервированный ананас и помидоры. Попробовать на вкус. Если соус слишком кислый, добавить остатки сахара. Тушить на медленном огне около 10 минут. Овощи должны оставаться слегка твердыми. Соус должен быть в меру густым.',
      'Обжарить курицу, соединить с соусом и потушить еще минут 10. Подавать с рисом.'
    ],
    recipeYield: '4 порции',
    recipeCategory: 'Основные блюда',
    url: 'https://eda.ru/recepty/osnovnye-blyuda/kurica-v-kislo-sladkom-souse-po-kitajski-14456',
    name: 'Курица в кисло-сладком соусе по-китайски',
    id: 1
  },
  {
    description: 'Азу по-татарски. Одно из немногих блюд, удостоившихся в советской продуктовой традиции продажи с именной нарезкой. И до сих пор в кулинариях и супермаркетах можно найти говядину, которую режут соломкой и продают как азу. Насчет самого блюда до сих пор идут споры, как и с чем готовить: использовать говядину или баранину, топленое или обычное масло, тушить в казане или сотейнике с толстым дном. Редакций этого блюда может быть много, но основа его всегда неизменна — это нарезанное соломкой мясо, картофель и томатный соус.',
    image: 'https://img06.rl0.ru/eda/c380x380i/s2.eda.ru/Photos/140802212008-160519080709-p-O-azu-po-tatarski.jpg',
    recipeIngredient: [
      {
        name: 'Говядина',
        count: '500',
        measure: 'гр.'
      },
      {
        name: 'Лук репчатый',
        count: '5',
        measure: 'шт.'
      },
      {
        name: 'Соленые огурцы',
        count: '3',
        measure: 'шт.'
      },
      {
        name: 'Томатная паста ',
        count: '2',
        measure: 'ст.л.'
      },
      {
        name: 'Картофель',
        count: '1000',
        measure: 'гр.'
      },
      {
        name: 'Мясной бульон',
        count: '1',
        measure: 'ст.'
      },
      {
        name: 'Чеснок',
        count: '3',
        measure: 'шт.'
      }
    ],
    'nutrition': {
      '@type': 'NutritionInformation',
      'calories': '525',
      'fatContent': '17',
      'carbohydrateContent': '66',
      'proteinContent': '33'
    },
    recipeInstructions: [
      'Мясо промыть, нарезать соломкой и слегка обжарить в казане в разогретом растительном масле.',
      'Добавить порезанный тонкими полукольцами лук и обжаривать мясо с луком до мягкости лука.',
      'Добавить томатную пасту, мелко нарезанные или тертые на крупной терке огурцы. Залить водой или бульоном и тушить под крышкой до полной готовности мяса.',
      'В отдельной сковороде обжарить нарезанный соломкой картофель.',
      'Когда картофель будет почти готов, переложить его в казан с тушеным мясом, добавить, соль, перец, лавровый лист и пропущенный через чеснокодавилку или мелко порезанный чеснок.',
      'Осторожно перемешать и тушить картофель с мясом до готовности примерно 5-7 минут.'
    ],
    recipeYield: '4 порции',
    recipeCategory: 'Основные блюда',
    url: 'https://eda.ru/recepty/osnovnye-blyuda/azu-po-tatarski-21751',
    name: 'Азу по-татарски',
    id: 2
  },
  {
    description: '',
    image: 'https://img06.rl0.ru/eda/c380x380i/s1.eda.ru/Photos/120424123536-140707095137-p-O-makaroni-zapechennie-s-pomidorami-pod-sirom.jpg',
    recipeIngredient: [
      {
        name: 'Макароны',
        count: '300',
        measure: 'гр.'
      },
      {
        name: 'Чеснок',
        count: '1',
        measure: 'шт.'
      },
      {
        name: 'Черный перец горошком',
        count: '10',
        measure: 'шт.'
      },
      {
        name: 'Сыр',
        count: '100',
        measure: 'гр.'
      },
      {
        name: 'Помидоры',
        count: '1',
        measure: 'шт.'
      },
      {
        name: 'Майонез',
        count: '150',
        measure: 'гр.'
      }
    ],
    'nutrition': {
      '@type': 'NutritionInformation',
      'calories': '1183',
      'fatContent': '67',
      'carbohydrateContent': '112',
      'proteinContent': '31'
    },
    recipeInstructions: [
      'Сварите макароны, положите их на дно емкости для выпекания. Порежьте помидоры тонкими ломтиками и положите их на макароны. ',
      'Потрите сыр. Посыпьте макароны с помидорами тертым сыром и перцем. ',
      'Чеснок порежьте крупными ломтиками и уложите сверху на запеканку. Обмажьте поверхность блюда тонким слоем майонеза и запекайте в духовке до готовности (примерно, 10–20 минут). ',
      'Подавайте в горячем виде, можно украсить зеленью.'
    ],
    recipeYield: '2 порции',
    recipeCategory: 'Основные блюда',
    url: 'https://eda.ru/recepty/osnovnye-blyuda/makaroni-zapechennie-s-pomidorami-pod-sirom-19696',
    name: 'Макароны, запеченные с помидорами, под сыром',
    id: 3
  },
  {
    description: 'Подавать на стол с гарниром, например, жареным кружочками картофелем, без жидкости — только овощи и мясо.',
    image: 'https://img09.rl0.ru/eda/c380x380i/s1.eda.ru/Photos/120131112336-140418202618-p-O-svinina-s-ovoschami-tushenaja-v-slivkah.jpg',
    recipeIngredient: [
      {
        name: 'Шампиньоны',
        count: '300',
        measure: 'гр.'
      },
      {
        name: 'Свиная вырезка',
        count: '400',
        measure: 'гр.'
      },
      {
        name: 'Сладкий перец',
        count: '100',
        measure: 'гр.'
      },
      {
        name: 'Помидоры',
        count: '100',
        measure: 'гр.'
      },
      {
        name: 'Сливки',
        count: '150',
        measure: 'мл.'
      },
      {
        name: 'Перец черный молотый по вкусу'
      },
      {
        name: 'Молотый белый перец по вкусу'
      },
      {
        name: 'Оливковое масло',
        count: '100',
        measure: 'мл.'
      }
    ],
    'nutrition': {
      '@type': 'NutritionInformation',
      'calories': '397',
      'fatContent': '34',
      'carbohydrateContent': '4',
      'proteinContent': '19'
    },
    recipeInstructions: [
      'Возьмите свинину и нарежьте на кубики, примерно сантиметр на сантиметр.',
      'Разогрейте сотейник и вылейте в него 50 мл оливкового масла. Выложите свинину в сотейник. Поперчите и посолите по вкусу. Жарьте мясо в течение 15 минут.',
      'Пока жарится мясо, нарежьте крупно шампиньоны, кубиками помидор и длинными тонкими полосками сладкий болгарский перец.',
      'После 15 минутной обжарки свинины вылейте образовавшийся сок или жир из сотейника. Добавьте в сотейник 50 мл оливкового масла и все овощи. Посолите и поперчите по вкусу. Жарьте 5 минут. Не забывайте помешивать.',
      'После обжарки овощей и мяса добавьте сливки и воду, чтобы овощи и мясо было на 2/3 погружены в жидкость. Тушите 15–20 минут. Следите, чтобы смесь сливок и воды не выкипела полностью.'
    ],
    recipeYield: '5 порций',
    recipeCategory: 'Основные блюда',
    url: 'https://eda.ru/recepty/osnovnye-blyuda/svinina-s-ovoschami-tushenaja-v-slivkah-31016',
    name: 'Свинина с овощами, тушеная в сливках',
    id: 4
  },
  {
    description: 'Картофель «Айдахо» — один из самых часто приготовляемых картофельных гарниров в мире. Несмотря на свое американское происхождение и оригинальное название (просто картофель там основная сельскохозяйственная культура), в России его больше знают как картофель по-деревенски. Чаще всего он подается к жареному мясу. Мясо может быть в любой форме: стейк, бургер, тонкая соломка. Впрочем, «Айдахо» вполне убедителен и без протеиновых скреп. Сам по себе. Как свой собственный штат Айдахо.',
    image: 'https://img07.rl0.ru/eda/c380x380i/s2.eda.ru/Photos/151212225533-151221213208-p-O-kartofel-ajdaho.jpg',
    recipeIngredient: [
      {
        name: 'Молодой картофель',
        count: '10',
        measure: 'шт.'
      },
      {
        name: 'Оливковое масло',
        count: '250',
        measure: 'мл.'
      },
      {
        name: 'Укроп',
        count: '1',
        measure: 'шт.'
      },
      {
        name: 'Петрушка',
        count: '1',
        measure: 'шт.'
      },
      {
        name: 'Чеснок',
        count: '3',
        measure: 'шт.'
      },
      {
        name: 'Красный соус табаско',
        count: '1',
        measure: 'ч.л.'
      },
      {
        name: 'Соль по вкусу'
      }
    ],
    'nutrition': {
      '@type': 'NutritionInformation',
      'calories': '978',
      'fatContent': '85',
      'carbohydrateContent': '46',
      'proteinContent': '10'
    },
    recipeInstructions: [
      'Картофель хорошо промыть (очищать не надо), нарезать вдоль на восемь долек, положить в кастрюлю с холодной подсоленной водой.',
      'Довести до кипения и варить 2–3 минуты. Слить воду и поставить картофель остывать.',
      'Смешать оливковое масло с мелко порезанной зеленью, соусом и продавленным через чеснокодавилку чесноком. Выложить картофель на противень в один слой, предварительно обмакнув дольки в получившуюся смесь.',
      'Запекать в духовке 15–20 минут при температуре 200 градусов.'
    ],
    recipeYield: '3 порции',
    recipeCategory: 'Основные блюда',
    'suitableForDiet': 'Веганская еда',
    url: 'https://eda.ru/recepty/osnovnye-blyuda/kartofel-ajdaho-30625',
    name: 'Картофель «Айдахо»',
    id: 5
  },
  {
    description: 'Ароматный, сытный, шипящий домашний картофель, фаршированный сметанно-беконной начинкой, — это очень простой и очень эффектный способ накормить большое количество человек, практически не потратив на готовку ни сил, ни времени. Обычную картошку при желании тут можно заменить на сладкий батат,\r\nа в начинку добавить, к примеру, кукурузу или сладкий красный перец.',
    image: 'https://img02.rl0.ru/eda/c380x380i/s1.eda.ru/Photos/120131082748-170604150624-p-O-kartofel-zapechennij-v-mundire.jpg',
    recipeIngredient: [
      {
        name: 'Картофель',
        count: '4',
        measure: 'шт.'
      },
      {
        name: 'Чеснок',
        count: '4',
        measure: 'шт.'
      },
      {
        name: 'Сливочное масло',
        count: '100',
        measure: 'гр.'
      },
      {
        name: 'Сметана',
        count: '2',
        measure: 'ст.л.'
      },
      {
        name: 'Бекон',
        count: '4',
        measure: 'шт.'
      },
      {
        name: 'Укроп по вкусу'
      },
      {
        name: 'Твердый сыр',
        count: '200',
        measure: 'гр.'
      },
      {
        name: 'Зеленый лук по вкусу'
      },
      {
        name: 'Соль по вкусу'
      },
      {
        name: 'Свежемолотый черный перец по вкусу'
      }
    ],
    'nutrition': {
      '@type': 'NutritionInformation',
      'calories': '572',
      'fatContent': '45',
      'carbohydrateContent': '22',
      'proteinContent': '19'
    },
    recipeInstructions: [
      'Разогреть духовку до 200 градусов. Вымыть и обсушить клубни картофеля — кожица должна быть сухой, тогда она подрумянится и станет хрустящей. Каждую картофелину натереть небольшим количеством оливкового масла и солью и поставить в духовку на час-полтора.',
      'За полчаса до готовности картофеля положить на лист фольги неочищенные зубчики чеснока, посолить, поперчить, добавить немного сливочного и столовую ложку оливкового масла. Завернуть и поместить в духовку.',
      'Пока картофель и чеснок запекаются, ломтики бекона мелко нарезать и слегка обжарить до золотистого цвета на хорошо разогретой сухой сковороде. Отставить на время.',
      'Вынуть из духовки картофель и остудить. Острым ножом разрезать картофелины вдоль пополам, затем аккуратно, стараясь не повредить кожуру, ложкой вынуть мякоть и переложить в большую миску.',
      'Добавить в миску очищенный от шкурки печеный чеснок, сметану, немного оливкового масла, рубленую зелень, обжаренный бекон, почти весь тертый сыр (кроме пяти-шести столовых ложек) и аккуратно перемешать, стараясь не превратить смесь в пюре.',
      'При помощи столовой ложки начинить получившимся фаршем каждую картофельную половинку и выложить их шкурками вниз на широкий противень. Хорошо разогреть гриль в духовке.',
      'Сверху на каждую картофельную дольку выложить по паре кубиков очень холодного сливочного масла и посыпать оставшимся тертым сыром. Отправить в духовку на семь-десять минут.',
      'Запекать картофель до появления легкой румяной корочки. Готовые дольки слегка остудить и сразу подавать, сбрызнув небольшим количеством оливкового масла.'
    ],
    recipeYield: '4 порции',
    recipeCategory: 'Основные блюда',
    url: 'https://eda.ru/recepty/osnovnye-blyuda/kartofel-zapechennij-v-mundire-23962',
    name: 'Картофель, запеченный в мундире',
    id: 6
  }
  ];

